# Firs NoteBook

In [9]:
import pandas as pd

Criando dicionário

In [5]:
turma = {
    'nome': ['A', 'B', 'C'],
    'notas': [7, 10, 9],
    'presença': [80, 90, 100],
}

## DataFrame

In [10]:
turma_df = pd.DataFrame(turma)
turma_df

  nome  notas  presença
0    A      7        80
1    B     10        90
2    C      9       100

In [12]:
display(turma_df)

  nome  notas  presença
0    A      7        80
1    B     10        90
2    C      9       100

In [13]:
coluna = pd.Series([10, 20, 30])
coluna

0    10
1    20
2    30
dtype: int64

## Lendo e Maipulando Tabelas

In [16]:
df = pd.read_csv('turma.csv')
df

       Nome   Nota   Presença
0  Andressa    7.7         90
1   Beatriz    9.8         99
2     Celso   10.0        100
3     Karla    9.0        100

In [25]:
df_excel = pd.read_excel('Vendas.xlsx', sheet_name='Plan1')
df_excel

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
0,1,2019-01-01,Iguatemi Esplanada,Sapato Estampa,1,358,358
1,1,2019-01-01,Iguatemi Esplanada,Camiseta,2,180,360
2,1,2019-01-01,Iguatemi Esplanada,Sapato Xadrez,1,368,368
3,2,2019-01-02,Norte Shopping,Relógio,3,200,600
4,2,2019-01-02,Norte Shopping,Chinelo Liso,1,71,71
...,...,...,...,...,...,...,...
100994,69996,2019-12-26,Center Shopping Uberlândia,Short Listrado,2,102,204
100995,69996,2019-12-26,Center Shopping Uberlândia,Mochila,4,270,1080
100996,69996,2019-12-26,Center Shopping Uberlândia,Pulseira Estampa,1,87,87
100997,69997,2019-12-26,Ribeirão Shopping,Camisa Listrado,1,108,108
100998,69997,2019-12-26,Ribeirão Shopping,Short Linho,2,133,266

In [37]:
df_excel[['Valor Final']]

        Valor Final
0               358
1               360
2               368
3               600
4                71
...             ...
100994          204
100995         1080
100996           87
100997          108
100998          266

[100999 rows x 1 columns]

In [38]:
df_excel[['ID Loja', 'Quantidade']]

                           ID Loja  Quantidade
0               Iguatemi Esplanada           1
1               Iguatemi Esplanada           2
2               Iguatemi Esplanada           1
3                   Norte Shopping           3
4                   Norte Shopping           1
...                            ...         ...
100994  Center Shopping Uberlândia           2
100995  Center Shopping Uberlândia           4
100996  Center Shopping Uberlândia           1
100997           Ribeirão Shopping           1
100998           Ribeirão Shopping           2

[100999 rows x 2 columns]

Como essa tabela tem escala bem maior podemos usar os comandos a seguir para ler, respectivamente, as 5 primeiras e 5 últimas linhas

In [28]:
df_excel.head()

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
0,1,2019-01-01,Iguatemi Esplanada,Sapato Estampa,1,358,358
1,1,2019-01-01,Iguatemi Esplanada,Camiseta,2,180,360
2,1,2019-01-01,Iguatemi Esplanada,Sapato Xadrez,1,368,368
3,2,2019-01-02,Norte Shopping,Relógio,3,200,600
4,2,2019-01-02,Norte Shopping,Chinelo Liso,1,71,71

In [29]:
df_excel.tail()

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
100994,69996,2019-12-26,Center Shopping Uberlândia,Short Listrado,2,102,204
100995,69996,2019-12-26,Center Shopping Uberlândia,Mochila,4,270,1080
100996,69996,2019-12-26,Center Shopping Uberlândia,Pulseira Estampa,1,87,87
100997,69997,2019-12-26,Ribeirão Shopping,Camisa Listrado,1,108,108
100998,69997,2019-12-26,Ribeirão Shopping,Short Linho,2,133,266

## Filtros

In [24]:
heroes = {
    "Superman": {
        "attack": 95,
        "defense": 98,
        "speed": 90,
        "intelligence": 85
    },
    "Batman": {
        "attack": 70,
        "defense": 80,
        "speed": 75,
        "intelligence": 99
    },
    "Wonder Woman": {
        "attack": 90,
        "defense": 90,
        "speed": 85,
        "intelligence": 80
    },
    "Spider-Man": {
        "attack": 80,
        "defense": 75,
        "speed": 85,
        "intelligence": 88
    },
    "Black Panther": {
        "attack": 82,
        "defense": 78,
        "speed": 83,
        "intelligence": 88
    }
}

df_heroes = pd.DataFrame(heroes)
display(df_heroes)

              Superman  Batman  Wonder Woman  Spider-Man  Black Panther
attack              95      70            90          80             82
defense             98      80            90          75             78
speed               90      75            85          85             83
intelligence        85      99            80          88             88

Nesse exemplo os heróis são colunas e os atributos são linhas, então para filtrar attack > 80, por exemplo, devemos transpor a tabela ou usando:
- **.loc:** acessador de dados por rótulo (label)
- **.column:** atributo que retorna os nomes das colunas do DataFrame (nesse caso, os heróis).

In [26]:
df_heroes.columns

Index(['Superman', 'Batman', 'Wonder Woman', 'Spider-Man', 'Black Panther'], dtype='object')

In [30]:
df_heroes.loc['attack'] > 80

Superman          True
Batman           False
Wonder Woman      True
Spider-Man       False
Black Panther     True
Name: attack, dtype: bool

In [32]:
df_heroes[df_heroes.columns[df_heroes.loc['attack'] > 80]]

              Superman  Wonder Woman  Black Panther
attack              95            90             82
defense             98            90             78
speed               90            85             83
intelligence        85            80             88

Ou pela transposta:

In [34]:
df_heroes.T[df_heroes.T['attack'] > 80]

               attack  defense  speed  intelligence
Superman           95       98     90            85
Wonder Woman       90       90     85            80
Black Panther      82       78     83            88

Combinação de mais de um filtro

In [ ]:
filtro_ataque_maior_que_80 = df_heroes.T['attack']